Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-pluginGnomad"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomad"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomad-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomad"
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomad-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomad"
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad annotations to sVEP result rows."
      + filename                       = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
      + function_name                  = "svep-backend-pluginGnomad"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomad",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a6f53b6fab1bc6c92e45c46941de74e031d5e5395431fe66ea631f33a47cb88c.zip"
          + "timestamp" = "1758509789830739000"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-pluginGnomadConstraint"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomadConstraint"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadConstraint-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadConstraint"
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadConstraint-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadConstraint"
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad Constraint annotations to sVEP result rows."
      + filename                       = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
      + function_name                  = "svep-backend-pluginGnomadConstraint"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadConstraint",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/58619988e72b30a1935fb3a192a1bc4832cd3330e8380e8df397e9c7e4c8f9c8.zip"
          + "timestamp" = "1758509789105492200"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-pluginGnomadOneKG"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomadOneKG"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadOneKG-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadOneKG"
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginGnomadOneKG-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginGnomadOneKG"
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad 1kg annotations to sVEP result rows."
      + filename                       = "builds/b31d84bfad0ca462b671ad479284681130669710558fd81beefef9104f939815.zip"
      + function_name                  = "svep-backend-pluginGnomadOneKG"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b31d84bfad0ca462b671ad479284681130669710558fd81beefef9104f939815.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b31d84bfad0ca462b671ad479284681130669710558fd81beefef9104f939815.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/b31d84bfad0ca462b671ad479284681130669710558fd81beefef9104f939815.zip"
          + "timestamp" = "1758509790272413000"
        }
    }

  # module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-qcFigures"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-qcFigures"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Running vcfstats for generating graphic."
      + function_name                  = "svep-backend-qcFigures"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3000
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FILE_LOCATION"   = "gaspi-dataportal-20250725085318492000000003"
              + "HTS_S3_HOST"     = "s3.ap-southeast-3.amazonaws.com"
              + "RESULT_DURATION" = "86400"
              + "USER_POOL_ID"    = "ap-southeast-3_BPVU2Ch1c"
            }
        }

      + ephemeral_storage {
          + size = 10240
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-qcNotes.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-qcNotes.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-qcNotes"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-qcNotes.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-qcNotes"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-qcNotes.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-qcNotes-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003/*",
                          + "arn:aws:s3:::gaspi-dataportal-20250725085318492000000003",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "svep-backend-qcNotes"
    }

  # module.svep[0].module.lambda-qcNotes.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-qcNotes-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcNotes"
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Running qcNotes API."
      + filename                       = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip"
      + function_name                  = "svep-backend-qcNotes"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FILE_LOCATION" = "gaspi-dataportal-20250725085318492000000003"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-qcNotes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/qcNotes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip"
          + "timestamp" = "1758509788975720000"
        }
    }

  # module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-queryGTF"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryGTF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-queryGTF-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-queryGTF"
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-queryGTF-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-queryGTF"
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries GTF for a specified VCF regions."
      + filename                       = "builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip"
      + function_name                  = "svep-backend-queryGTF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/queryGTF",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a67365d52781e62bb07c35372e6a327f313eb419234d8ed967ed45860fecd179.zip"
          + "timestamp" = "1758509789264916000"
        }
    }

  # module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-queryVCF"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-queryVCF-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-queryVCF"
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-queryVCF-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-queryVCF"
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes queryGTF for each region."
      + filename                       = "builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip"
      + function_name                  = "svep-backend-queryVCF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 140
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/queryVCF",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/aafb45684d944fa8a5f32817ab2e88b726c7c282e4eedf436cd6cbf16e2f86c5.zip"
          + "timestamp" = "1758509789620549000"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-queryVCFsubmit"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCFsubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-queryVCFsubmit-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-queryVCFsubmit"
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-queryVCFsubmit-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-queryVCFsubmit"
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "This lambda will be called if there are too many batchids to be processed within"
      + filename                       = "builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip"
      + function_name                  = "svep-backend-queryVCFsubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "STAGING"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "GXC"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/queryVCFsubmit",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/1bd66140491a106ea4acdcea0b4086f7b4c132551e1fd188039bb3f352e29547.zip"
          + "timestamp" = "1758509790307770000"
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-sendJobEmail"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-sendJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendClinicJobEmail"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  + {
                      + Action   = "cognito-idp:ListUsers"
                      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.